# Вычислить число c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

d = input('Введите число в диапазоне от 0.1 до 0.0000000001: ')
if 0.1 >= float(d) >= 0.0000000001:
    n = abs(d.find('.') - len(d))-1
    h = int(n)
    k = 1
    x = 0
    import random
    for k in range(1, 1000000):
        x = x+4*((-1)**(k+1))/(2*k-1)
    print("\033[H\033[J")
    print(f"Число π = {round(x,h)}")
